20230930175757-entitycomponentsystem.org
:PROPERTIES:
:ID:       dc45bd7d-b8c4-47ef-ae84-c548f81c50bb
:END:
#+title: EntityComponentSystem
* 概要
Entity Component Systemは[[id:8b79aef9-1073-4788-9e81-68cc63e4f997][game]]でよく採用されるソフトウェアアーキテクチャパターン。

- [[https://ja.wikipedia.org/wiki/%E3%82%A8%E3%83%B3%E3%83%86%E3%82%A3%E3%83%86%E3%82%A3%E3%83%BB%E3%82%B3%E3%83%B3%E3%83%9D%E3%83%BC%E3%83%8D%E3%83%B3%E3%83%88%E3%83%BB%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0][エンティティ・コンポーネント・システム - Wikipedia]]
* Memo
* Tasks
* Reference
** [[https://zenn.dev/toyboot4e/books/making-toy-ecs][[WIP] Entity-Component-System 実装]]
ECSの解説。
* Archives
** DONE ECS(Entity Component System)入門
CLOSED: [2022-06-11 Sat 15:21]
:LOGBOOK:
CLOCK: [2022-06-05 Sun 21:02]--[2022-06-05 Sun 21:27] =>  0:25
CLOCK: [2022-06-05 Sun 15:53]--[2022-06-05 Sun 16:18] =>  0:25
CLOCK: [2022-06-05 Sun 15:28]--[2022-06-05 Sun 15:53] =>  0:25
CLOCK: [2022-06-05 Sun 15:02]--[2022-06-05 Sun 15:27] =>  0:25
:END:
ゲームライブラリについての理解がないので、本で学ぶ。

Entity Component System、MVCのようなものである。
- Entityはゲーム内のオブジェクトの識別子。Entityは単体では具体的な機能は持たず、Componentと紐付ける。自キャラクター、敵キャラクター、ステージの障害物
- Componentは機能を分解したデータ。ゲーム内の機能を構成するデータ。位置やスケールを定義する機能、画像などの描画機能。Componentは配列的に管理される
- Systemは、Componentへの作用を行う。ゲーム内のロジックをComponent単位で考え、Componentを入出力する処理として実装する。Component配列に対して一括で処理を行ってロジックを実現する

Resourceはオブジェクトに紐付かないゲーム中の機能の役割を果たす要素。
Resourceは(Read+Write)、(ReadExpect+WriteExpect)を利用し、Componentは(ReadStorage+WriteStorage)を利用する。Resoource作成はinsert、取得はtry_fetch::<Hoge>{}, try_fetch_mut::<Hoge>{}。
