20230930175757-entitycomponentsystem.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>EntityComponentSystem</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">EntityComponentSystem</h1>
<div id="outline-container-org8eaec07" class="outline-2">
<h2 id="org8eaec07"><a href="#org8eaec07">概要</a></h2>
<div class="outline-text-2" id="text-org8eaec07">
<p>
Entity Component Systemは<a href="20210926145504-game.html#ID-8b79aef9-1073-4788-9e81-68cc63e4f997">game</a>でよく採用されるソフトウェアアーキテクチャパターン。
</p>

<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/%E3%82%A8%E3%83%B3%E3%83%86%E3%82%A3%E3%83%86%E3%82%A3%E3%83%BB%E3%82%B3%E3%83%B3%E3%83%9D%E3%83%BC%E3%83%8D%E3%83%B3%E3%83%88%E3%83%BB%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0">エンティティ・コンポーネント・システム - Wikipedia</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6f2457c" class="outline-2">
<h2 id="org6f2457c"><a href="#org6f2457c">Memo</a></h2>
</div>
<div id="outline-container-org53aaa5c" class="outline-2">
<h2 id="org53aaa5c"><a href="#org53aaa5c">Tasks</a></h2>
</div>
<div id="outline-container-orgf6eb1f5" class="outline-2">
<h2 id="orgf6eb1f5"><a href="#orgf6eb1f5">Reference</a></h2>
<div class="outline-text-2" id="text-orgf6eb1f5">
</div>
<div id="outline-container-org3b49a90" class="outline-3">
<h3 id="org3b49a90"><a href="#org3b49a90"><a href="https://zenn.dev/toyboot4e/books/making-toy-ecs">[WIP] Entity-Component-System 実装</a></a></h3>
<div class="outline-text-3" id="text-org3b49a90">
<p>
ECSの解説。
</p>
</div>
</div>
</div>
<div id="outline-container-org4179540" class="outline-2">
<h2 id="org4179540"><a href="#org4179540">Archives</a></h2>
<div class="outline-text-2" id="text-org4179540">
</div>
<div id="outline-container-orge93a9d3" class="outline-3">
<h3 id="orge93a9d3"><a href="#orge93a9d3"><span class="done DONE">DONE</span> ECS(Entity Component System)入門</a></h3>
<div class="outline-text-3" id="text-orge93a9d3">
<p>
ゲームライブラリについての理解がないので、本で学ぶ。
</p>

<p>
Entity Component System、MVCのようなものである。
</p>
<ul class="org-ul">
<li>Entityはゲーム内のオブジェクトの識別子。Entityは単体では具体的な機能は持たず、Componentと紐付ける。自キャラクター、敵キャラクター、ステージの障害物</li>
<li>Componentは機能を分解したデータ。ゲーム内の機能を構成するデータ。位置やスケールを定義する機能、画像などの描画機能。Componentは配列的に管理される</li>
<li>Systemは、Componentへの作用を行う。ゲーム内のロジックをComponent単位で考え、Componentを入出力する処理として実装する。Component配列に対して一括で処理を行ってロジックを実現する</li>
</ul>

<p>
Resourceはオブジェクトに紐付かないゲーム中の機能の役割を果たす要素。
Resourceは(Read+Write)、(ReadExpect+WriteExpect)を利用し、Componentは(ReadStorage+WriteStorage)を利用する。Resoource作成はinsert、取得はtry_fetch::&lt;Hoge&gt;{}, try_fetch_mut::&lt;Hoge&gt;{}。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
